# Expression Operators — MongoDB

Ce notebook est dédié aux **opérateurs d'expression MongoDB**.  
Il a été fait pour un travail en groupe.

Chaque membre peut compléter une section en ajoutant :
- Une explication simple
- Un exemple compréhensible par un non-technicien
- Une requête d’agrégation MongoDB illustrant l’opérateur

---

In [1]:
from pymongo import MongoClient
import pandas as pd

# Connexion à MongoDB local (Docker)
client = MongoClient("mongodb://localhost:27018/")

# Connexion à la base "testdb"
db = client.testdb

## Opérateur `$sum`

L’opérateur `$sum` permet de calculer la somme d’un ensemble de valeurs.

---

**Exemple :**  
Chaque vendeur a effectué plusieurs ventes.  
On veut calculer le **montant total** vendu par chacun.

> Collection utilisée : `sum_example`

In [2]:
# Création de la collection
sum_example = db.sum_example
sum_example.delete_many({})

# Données insérées
sum_example.insert_many([
    { "seller": "Rachid", "sales": [200, 150, 400] },
    { "seller": "Julie", "sales": [300, 120] },
    { "seller": "Antoine", "sales": [500, 250, 100, 50] }
])

# Agrégation : somme des ventes
total_sales = [
    {
        "$project": {
            "seller": 1,
            "total_sales": { "$sum": "$sales" }
        }
    }
]

results = list(sum_example.aggregate(total_sales))
pd.DataFrame(results)

                        _id   seller  total_sales
0  68891c9a514db4d22d163dd4   Rachid          750
1  68891c9a514db4d22d163dd5    Julie          420
2  68891c9a514db4d22d163dd6  Antoine          900

## C. Opérateur `$avg`

L’opérateur `$avg` permet de calculer la **moyenne** d’un tableau de nombres.

---

**Exemple :**  
Chaque agent de support reçoit des notes après ses appels clients.  
On veut connaître la **note moyenne** de chaque agent.

> Collection utilisée : `avg_example`

In [3]:
# Création de la collection
avg_example = db.avg_example
avg_example.delete_many({})

# Données insérées
avg_example.insert_many([
    { "agent": "Lina", "ratings": [4.5, 4.2, 5.0, 3.9] },
    { "agent": "Samir", "ratings": [3.8, 4.1, 4.0] },
    { "agent": "Morgane", "ratings": [4.9, 5.0, 4.8] }
])

# Agrégation : moyenne des notes
average_scores = [
    {
        "$project": {
            "agent": 1,
            "average_rating": { "$avg": "$ratings" }
        }
    }
]

results = list(avg_example.aggregate(average_scores))
pd.DataFrame(results)

                        _id    agent  average_rating
0  68891ca0514db4d22d163dd7     Lina        4.400000
1  68891ca0514db4d22d163dd8    Samir        3.966667
2  68891ca0514db4d22d163dd9  Morgane        4.900000

## D. Opérateur `$min`

L’opérateur `$min` retourne la plus petite valeur d’un tableau.

---

**Exemple :**  
On suit les **variations de prix** d’un produit dans différents magasins.  
On veut connaître le **prix le plus bas** pour chaque produit.

> Collection utilisée : `min_example`

In [4]:
min_example = db.min_example
min_example.delete_many({})

min_example.insert_many([
    { "product": "Aspirateur", "prices": [129.99, 115.50, 122.00] },
    { "product": "Smartphone", "prices": [599.99, 560.00, 610.00] },
    { "product": "Casque audio", "prices": [89.90, 79.99, 85.00] },
    {"product": "MacBook Pro", "prices": [1789.90, 1779.99, 1885.00] }
])

lowest_prices = [
    {
        "$project": {
            "product": 1,
            "lowest_price": { "$min": "$prices" }
        }
    }
]

results = list(min_example.aggregate(lowest_prices))
pd.DataFrame(results)

                        _id       product  lowest_price
0  68891ca4514db4d22d163dda    Aspirateur        115.50
1  68891ca4514db4d22d163ddb    Smartphone        560.00
2  68891ca4514db4d22d163ddc  Casque audio         79.99
3  68891ca4514db4d22d163ddd   MacBook Pro       1779.99

## Opérateur `$max`

L’opérateur `$max` retourne la valeur la plus grande d’un groupe.

---

**Exemple :**  
On suit les **variations de prix** d’un produit dans différents magasins.  
On veut connaître le **prix le plus haut** pour chaque produit.

> Collection utilisée : `max_example`

In [5]:
max_example = db.max_example
max_example.delete_many({})

max_example.insert_many([
    { "product": "Aspirateur", "prices": [129.99, 115.50, 122.00] },
    { "product": "Smartphone", "prices": [599.99, 560.00, 610.00] },
    { "product": "Casque audio", "prices": [89.90, 79.99, 85.00] },
    {"product": "MacBook Pro", "prices": [1789.90, 1779.99, 1885.00] }
])

highest_prices = [
    {
        "$project": {
            "product": 1,
            "highest_price": { "$max": "$prices" }
        }
    }
]

results = list(max_example.aggregate(highest_prices))
pd.DataFrame(results)

                        _id       product  highest_price
0  68891ca9514db4d22d163dde    Aspirateur         129.99
1  68891ca9514db4d22d163ddf    Smartphone         610.00
2  68891ca9514db4d22d163de0  Casque audio          89.90
3  68891ca9514db4d22d163de1   MacBook Pro        1885.00

## Opérateur `$first`

L’opérateur `$first` retourne le premier document ou la première valeur d’un groupe, selon l’ordre d’arrivée.

---

In [7]:
#Code à ajouter

## Opérateur `$last`

L’opérateur `$last` retourne le dernier document ou la dernière valeur d’un groupe, selon l’ordre d’arrivée.

---

In [8]:
#Code à ajouter

## Opérateur `$concat`

L’opérateur `$concat` est un opérateur d'aggrégation qui permet de fusionner plusieurs chaînes de caractères entre elles. Il s'invoque de la façon suivante:

`{ $concat: [ <expression1>, <expression2>, ... ] }`

---

Pour l'exemple, on va créer une collection de comptes bancaires.

In [6]:
try:
    my_collection = db.create_collection("concat")
except:
    db.concat.drop()
    my_collection = db.create_collection("concat")

documents = [
    {"account": "A", "amount": "1890", "currency": "€"},
    {"account": "B", "amount": "2531", "currency": "£"},
    {"account": "C", "amount": "936", "currency": "$"},
    {"account": "D", "amount": "12534", "currency": "€"},
    {"account": "E", "amount": "9876", "currency": "$"},
]
result_many = my_collection.insert_many(documents)

On va crée un champ **info** qui concatène les champs **amount** et **currency** dans une phrase grâce à l'opérateur d'aggrégation `$concat`.

In [7]:
info = {
    "$addFields": {
        "info": {"$concat": ["Ce compte contient ","$amount", " ", "$currency", "."]}
    }
}
pd.DataFrame(my_collection.aggregate([info]).to_list())

,_id,account,amount,currency,info
0,68891cb5514db4d22d163de2,A,1890,€,Ce compte contient 1890 €.
1,68891cb5514db4d22d163de3,B,2531,£,Ce compte contient 2531 £.
2,68891cb5514db4d22d163de4,C,936,$,Ce compte contient 936 $.
3,68891cb5514db4d22d163de5,D,12534,€,Ce compte contient 12534 €.
4,68891cb5514db4d22d163de6,E,9876,$,Ce compte contient 9876 $.

## Opérateur `$substrBytes`

L’opérateur `$substrBytes` permet d’extraire une sous-chaîne de caractères à partir d’une chaîne plus grande en indiquant le premier indice et le nombre de caractères (le nombre de Bytes) que l'on souhaite extraire. Il s'invoque de la façon suivante:

`{ $substrBytes: [ <string expression>, <byte index>, <byte count> ] }`

---

Pour l'exemple, on va créer une collection de comptes bancaires.

In [8]:
try:
    my_collection = db.create_collection("substrBytes")
except:
    db.substrBytes.drop()
    my_collection = db.create_collection("substrBytes")

documents = [
    {"account": "A", "amount": "Ce compte contient  1890 €."},
    {"account": "B", "amount": "Ce compte contient  2531 €."},
    {"account": "C", "amount": "Ce compte contient   936 €."},
    {"account": "D", "amount": "Ce compte contient 12534 €."},
    {"account": "E", "amount": "Ce compte contient  9876 €."},
]
result_many = my_collection.insert_many(documents)

Le champ **amount** est une longue chaîne de caractères, on souhaite en extraire uniquement le montant grâce à l'opérateur d'aggrégation `$substrBytes`.

In [9]:
amounts_money = {
    "$addFields": {
        "money": {"$trim": {"input": {
            "$substrBytes": ["$amount", 19, 5]
            }
        }}
    }
}
pd.DataFrame(my_collection.aggregate([amounts_money]).to_list())

                        _id account                       amount  money
0  68891cde514db4d22d163de7       A  Ce compte contient  1890 €.   1890
1  68891cde514db4d22d163de8       B  Ce compte contient  2531 €.   2531
2  68891cde514db4d22d163de9       C  Ce compte contient   936 €.    936
3  68891cde514db4d22d163dea       D  Ce compte contient 12534 €.  12534
4  68891cde514db4d22d163deb       E  Ce compte contient  9876 €.   9876

## Opérateur `$toInt`

L’opérateur `$toInt` permet de convertir une valeur en entier (integer). C'est un opérateur d'aggrégation, il s'invoque de la façon suivante.

`{$toInt: <expression>}`

---

Pour l'exemple, on va créer une collection de comptes bancaires.

In [10]:
try:
    my_collection = db.create_collection("toInt")
except:
    db.toInt.drop()
    my_collection = db.create_collection("toInt")

documents = [
    {"account": "A", "amount": "1890"},
    {"account": "B", "amount": "2531"},
    {"account": "C", "amount": "936"},
    {"account": "D", "amount": "12534"},
    {"account": "E", "amount": "9876"},
]
result_many = my_collection.insert_many(documents)

Le champ **amount** étant une chaîne de caractères, on peut les convertir grâce à l'opérateur d'aggrégation `$toInt`.

In [11]:
amounts_money = {
    "$addFields": {
        "money": {"$toInt": "$amount"}
    }
}
pd.DataFrame(my_collection.aggregate([amounts_money]).to_list())

                        _id account amount  money
0  68891cf5514db4d22d163dec       A   1890   1890
1  68891cf5514db4d22d163ded       B   2531   2531
2  68891cf5514db4d22d163dee       C    936    936
3  68891cf5514db4d22d163def       D  12534  12534
4  68891cf5514db4d22d163df0       E   9876   9876

## Opérateur `$toDouble`

L’opérateur `$toDouble` permet de convertir une valeur en nombre décimal (float). C'est un opérateur d'aggrégation, il s'invoque de la façon suivante.

`{$toDouble: <expression>}`

---

Pour l'exemple, on va créer une collection de compte bancaire.

In [12]:
try:
    my_collection = db.create_collection("toDouble")
except:
    db.toDouble.drop()
    my_collection = db.create_collection("toDouble")

documents = [
    {"account": "A", "amount": "1890.59"},
    {"account": "B", "amount": "2531.48"},
    {"account": "C", "amount": "936.10"},
    {"account": "D", "amount": "12534.21"},
    {"account": "E", "amount": "9876.54"},
]
result_many = my_collection.insert_many(documents)

Le champ **amount** étant une chaîne de caractères, on peut les convertir grâce à l'opérateur d'aggrégation `$toDouble`.

In [13]:
amounts_money = {
    "$addFields": {
        "money": {"$toDouble": "$amount"}
    }
}
pd.DataFrame(my_collection.aggregate([amounts_money]).to_list())

                        _id account    amount     money
0  68891cfc514db4d22d163df1       A   1890.59   1890.59
1  68891cfc514db4d22d163df2       B   2531.48   2531.48
2  68891cfc514db4d22d163df3       C    936.10    936.10
3  68891cfc514db4d22d163df4       D  12534.21  12534.21
4  68891cfc514db4d22d163df5       E   9876.54   9876.54

---

## Conclusion